; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_18_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 - counter
	)
  (:init
		(= (value c0) 46)
	(= (value c1) 54)
	(= (value c2) 82)
	(= (value c3) 7)
	(= (value c4) 18)
	(= (value c5) 58)
	(= (value c6) 99)
	(= (value c7) 32)
	(= (value c8) 61)
	(= (value c9) 56)
	(= (value c10) 90)
	(= (value c11) 86)
	(= (value c12) 70)
	(= (value c13) 60)
	(= (value c14) 28)
	(= (value c15) 7)
	(= (value c16) 99)
	(= (value c17) 50)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
		)
	)
)

; plan
1. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 8 of 17
2. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 8 of 17
3. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 8 of 17
4. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 8 of 17
5. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 8 of 17
6. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 17
7. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 17
8. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 17
9. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 17
10. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 17
11. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 8 of 17
12. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 8 of 17
13. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 8 of 17
14. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 8 of 17
15. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 8 of 17
16. (increase_rate c15)
   changed: (rate_value c15) from 4 to 5
   goals met: 8 of 17
17. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 8 of 17
18. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 8 of 17
19. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 8 of 17
20. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 8 of 17
21. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 8 of 17
22. (increment c11)
   changed: (value c11) from 86 to 89
   goals met: 8 of 17
23. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 8 of 17
24. (increment c11)
   changed: (value c11) from 89 to 92
   goals met: 9 of 17
25. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 9 of 17
26. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 9 of 17
27. (increment c12)
   changed: (value c12) from 70 to 75
   goals met: 9 of 17
28. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 9 of 17
29. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 9 of 17
30. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 9 of 17
31. (increment c12)
   changed: (value c12) from 75 to 83
   goals met: 9 of 17
32. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 9 of 17
33. (increment c12)
   changed: (value c12) from 83 to 92
   goals met: 9 of 17
34. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 9 of 17
35. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 9 of 17
36. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 9 of 17
37. (increment c9)
   changed: (value c9) from 56 to 59
   goals met: 9 of 17
38. (increment c9)
   changed: (value c9) from 59 to 62
   goals met: 10 of 17
39. (increase_rate c15)
   changed: (rate_value c15) from 5 to 6
   goals met: 10 of 17
40. (increment c15)
   changed: (value c15) from 7 to 13
   goals met: 10 of 17
41. (increment c15)
   changed: (value c15) from 13 to 19
   goals met: 10 of 17
42. (increment c15)
   changed: (value c15) from 19 to 25
   goals met: 10 of 17
43. (increment c15)
   changed: (value c15) from 25 to 31
   goals met: 11 of 17
44. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 11 of 17
45. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 11 of 17
46. (increment c14)
   changed: (value c14) from 28 to 35
   goals met: 10 of 17
47. (increment c15)
   changed: (value c15) from 31 to 37
   goals met: 11 of 17
48. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 11 of 17
49. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 11 of 17
50. (decrement c12)
   changed: (value c12) from 92 to 83
   goals met: 11 of 17
51. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 11 of 17
52. (increment c14)
   changed: (value c14) from 35 to 42
   goals met: 10 of 17
53. (increment c15)
   changed: (value c15) from 37 to 43
   goals met: 11 of 17
54. (increase_rate c14)
   changed: (rate_value c14) from 7 to 8
   goals met: 11 of 17
55. (increase_rate c14)
   changed: (rate_value c14) from 8 to 9
   goals met: 11 of 17
56. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 11 of 17
57. (increment c14)
   changed: (value c14) from 42 to 52
   goals met: 10 of 17
58. (increment c15)
   changed: (value c15) from 43 to 49
   goals met: 10 of 17
59. (increment c15)
   changed: (value c15) from 49 to 55
   goals met: 11 of 17
60. (increment c14)
   changed: (value c14) from 52 to 62
   goals met: 11 of 17
61. (increment c15)
   changed: (value c15) from 55 to 61
   goals met: 11 of 17
62. (increment c15)
   changed: (value c15) from 61 to 67
   goals met: 12 of 17
63. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 12 of 17
64. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 12 of 17
65. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 12 of 17
66. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 12 of 17
67. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 12 of 17
68. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 12 of 17
69. (increase_rate c17)
   changed: (rate_value c17) from 6 to 7
   goals met: 12 of 17
70. (increment c17)
   changed: (value c17) from 50 to 57
   goals met: 12 of 17
71. (increase_rate c17)
   changed: (rate_value c17) from 7 to 8
   goals met: 12 of 17
72. (increase_rate c17)
   changed: (rate_value c17) from 8 to 9
   goals met: 12 of 17
73. (increment c17)
   changed: (value c17) from 57 to 66
   goals met: 12 of 17
74. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 12 of 17
75. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 12 of 17
76. (increase_rate c17)
   changed: (rate_value c17) from 9 to 10
   goals met: 12 of 17
77. (increment c17)
   changed: (value c17) from 66 to 76
   goals met: 12 of 17
78. (increment c17)
   changed: (value c17) from 76 to 86
   goals met: 12 of 17
79. (decrement c16)
   changed: (value c16) from 99 to 97
   goals met: 12 of 17
80. (increment c17)
   changed: (value c17) from 86 to 96
   goals met: 12 of 17
81. (decrement c16)
   changed: (value c16) from 97 to 95
   goals met: 13 of 17
82. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 13 of 17
83. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 13 of 17
84. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 13 of 17
85. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 13 of 17
86. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 13 of 17
87. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 13 of 17
88. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 13 of 17
89. (increment c7)
   changed: (value c7) from 32 to 39
   goals met: 13 of 17
90. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 13 of 17
91. (increment c7)
   changed: (value c7) from 39 to 47
   goals met: 13 of 17
92. (increment c7)
   changed: (value c7) from 47 to 55
   goals met: 13 of 17
93. (increment c7)
   changed: (value c7) from 55 to 63
   goals met: 12 of 17
94. (increment c7)
   changed: (value c7) from 63 to 71
   goals met: 12 of 17
95. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 12 of 17
96. (increment c7)
   changed: (value c7) from 71 to 80
   goals met: 12 of 17
97. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 12 of 17
98. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 12 of 17
99. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 12 of 17
100. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 12 of 17
101. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 12 of 17
102. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 12 of 17
103. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 12 of 17
104. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 12 of 17
105. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 12 of 17
106. (increment c3)
   changed: (value c3) from 7 to 16
   goals met: 12 of 17
107. (increment c3)
   changed: (value c3) from 16 to 25
   goals met: 11 of 17
108. (decrement c2)
   changed: (value c2) from 82 to 77
   goals met: 11 of 17
109. (decrement c2)
   changed: (value c2) from 77 to 72
   goals met: 11 of 17
110. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 11 of 17
111. (decrement c3)
   changed: (value c3) from 25 to 16
   goals met: 12 of 17
112. (decrement c2)
   changed: (value c2) from 72 to 66
   goals met: 12 of 17
113. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 12 of 17
114. (increment c3)
   changed: (value c3) from 16 to 26
   goals met: 11 of 17
115. (increment c3)
   changed: (value c3) from 26 to 36
   goals met: 11 of 17
116. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 11 of 17
117. (decrement c3)
   changed: (value c3) from 36 to 26
   goals met: 11 of 17
118. (decrement c2)
   changed: (value c2) from 66 to 59
   goals met: 11 of 17
119. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 11 of 17
120. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 11 of 17
121. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 11 of 17
122. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 11 of 17
123. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 11 of 17
124. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 11 of 17
125. (increment c13)
   changed: (value c13) from 60 to 65
   goals met: 10 of 17
126. (increment c13)
   changed: (value c13) from 65 to 70
   goals met: 10 of 17
127. (increment c14)
   changed: (value c14) from 62 to 72
   goals met: 10 of 17
128. (increment c15)
   changed: (value c15) from 67 to 73
   goals met: 11 of 17
129. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 11 of 17
130. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 11 of 17
131. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 11 of 17
132. (decrement c7)
   changed: (value c7) from 80 to 70
   goals met: 11 of 17
133. (decrement c6)
   changed: (value c6) from 99 to 96
   goals met: 11 of 17
134. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 11 of 17
135. (decrement c7)
   changed: (value c7) from 70 to 60
   goals met: 12 of 17
136. (decrement c6)
   changed: (value c6) from 96 to 92
   goals met: 12 of 17
137. (decrement c6)
   changed: (value c6) from 92 to 88
   goals met: 12 of 17
138. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 12 of 17
139. (increment c7)
   changed: (value c7) from 60 to 70
   goals met: 11 of 17
140. (decrement c6)
   changed: (value c6) from 88 to 83
   goals met: 11 of 17
141. (decrement c7)
   changed: (value c7) from 70 to 60
   goals met: 12 of 17
142. (decrement c6)
   changed: (value c6) from 83 to 78
   goals met: 12 of 17
143. (decrement c6)
   changed: (value c6) from 78 to 73
   goals met: 12 of 17
144. (increment c7)
   changed: (value c7) from 60 to 70
   goals met: 11 of 17
145. (decrement c6)
   changed: (value c6) from 73 to 68
   goals met: 12 of 17
146. (increment c13)
   changed: (value c13) from 70 to 75
   goals met: 11 of 17
147. (increment c14)
   changed: (value c14) from 72 to 82
   goals met: 11 of 17
148. (increment c15)
   changed: (value c15) from 73 to 79
   goals met: 11 of 17
149. (increment c15)
   changed: (value c15) from 79 to 85
   goals met: 12 of 17
150. (increment c13)
   changed: (value c13) from 75 to 80
   goals met: 12 of 17
151. (increment c12)
   changed: (value c12) from 83 to 93
   goals met: 13 of 17
152. (increment c3)
   changed: (value c3) from 26 to 36
   goals met: 13 of 17
153. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 13 of 17
154. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 13 of 17
155. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 13 of 17
156. (increment c4)
   changed: (value c4) from 18 to 21
   goals met: 13 of 17
157. (increment c4)
   changed: (value c4) from 21 to 24
   goals met: 13 of 17
158. (increment c4)
   changed: (value c4) from 24 to 27
   goals met: 13 of 17
159. (increment c4)
   changed: (value c4) from 27 to 30
   goals met: 13 of 17
160. (increment c4)
   changed: (value c4) from 30 to 33
   goals met: 13 of 17
161. (increment c4)
   changed: (value c4) from 33 to 36
   goals met: 13 of 17
162. (increment c4)
   changed: (value c4) from 36 to 39
   goals met: 14 of 17
163. (decrement c2)
   changed: (value c2) from 59 to 49
   goals met: 13 of 17
164. (increment c3)
   changed: (value c3) from 36 to 46
   goals met: 12 of 17
165. (increment c4)
   changed: (value c4) from 39 to 42
   goals met: 12 of 17
166. (increment c4)
   changed: (value c4) from 42 to 45
   goals met: 12 of 17
167. (increment c4)
   changed: (value c4) from 45 to 48
   goals met: 13 of 17
168. (increment c2)
   changed: (value c2) from 49 to 59
   goals met: 14 of 17
169. (increment c3)
   changed: (value c3) from 46 to 56
   goals met: 13 of 17
170. (increment c4)
   changed: (value c4) from 48 to 51
   goals met: 13 of 17
171. (increment c4)
   changed: (value c4) from 51 to 54
   goals met: 13 of 17
172. (increment c4)
   changed: (value c4) from 54 to 57
   goals met: 14 of 17
173. (decrement c2)
   changed: (value c2) from 59 to 49
   goals met: 14 of 17
174. (increment c13)
   changed: (value c13) from 80 to 85
   goals met: 13 of 17
175. (increment c14)
   changed: (value c14) from 82 to 92
   goals met: 13 of 17
176. (increment c15)
   changed: (value c15) from 85 to 91
   goals met: 13 of 17
177. (increment c15)
   changed: (value c15) from 91 to 97
   goals met: 13 of 17
178. (increment c16)
   changed: (value c16) from 95 to 97
   goals met: 12 of 17
179. (increment c16)
   changed: (value c16) from 97 to 99
   goals met: 13 of 17
180. (increment c13)
   changed: (value c13) from 85 to 90
   goals met: 13 of 17
181. (increment c13)
   changed: (value c13) from 90 to 95
   goals met: 13 of 17
182. (decrement_rate c17)
   changed: (rate_value c17) from 10 to 9
   goals met: 13 of 17
183. (decrement_rate c17)
   changed: (rate_value c17) from 9 to 8
   goals met: 13 of 17
184. (decrement_rate c17)
   changed: (rate_value c17) from 8 to 7
   goals met: 13 of 17
185. (decrement_rate c17)
   changed: (rate_value c17) from 7 to 6
   goals met: 13 of 17
186. (decrement_rate c17)
   changed: (rate_value c17) from 6 to 5
   goals met: 13 of 17
187. (decrement_rate c17)
   changed: (rate_value c17) from 5 to 4
   goals met: 13 of 17
188. (increment c17)
   changed: (value c17) from 96 to 100
   goals met: 14 of 17
189. (decrement c13)
   changed: (value c13) from 95 to 90
   goals met: 14 of 17
190. (decrement c12)
   changed: (value c12) from 93 to 83
   goals met: 14 of 17
191. (decrement c11)
   changed: (value c11) from 92 to 89
   goals met: 13 of 17
192. (decrement c11)
   changed: (value c11) from 89 to 86
   goals met: 13 of 17
193. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 13 of 17
194. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 13 of 17
195. (decrement c11)
   changed: (value c11) from 86 to 82
   goals met: 14 of 17
196. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 14 of 17
197. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 14 of 17
198. (decrement c10)
   changed: (value c10) from 90 to 87
   goals met: 14 of 17
199. (decrement c10)
   changed: (value c10) from 87 to 84
   goals met: 14 of 17
200. (decrement c10)
   changed: (value c10) from 84 to 81
   goals met: 15 of 17
201. (increment c2)
   changed: (value c2) from 49 to 59
   goals met: 15 of 17
202. (increment c3)
   changed: (value c3) from 56 to 66
   goals met: 15 of 17
203. (increment c4)
   changed: (value c4) from 57 to 60
   goals met: 14 of 17
204. (increment c4)
   changed: (value c4) from 60 to 63
   goals met: 14 of 17
205. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 14 of 17
206. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 14 of 17
207. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 14 of 17
208. (decrement c4)
   changed: (value c4) from 63 to 59
   goals met: 14 of 17
209. (decrement c4)
   changed: (value c4) from 59 to 55
   goals met: 15 of 17
210. (decrement c3)
   changed: (value c3) from 66 to 56
   goals met: 14 of 17
211. (decrement c3)
   changed: (value c3) from 56 to 46
   goals met: 15 of 17
212. (decrement c2)
   changed: (value c2) from 59 to 49
   goals met: 14 of 17
213. (decrement c2)
   changed: (value c2) from 49 to 39
   goals met: 15 of 17
214. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 15 of 17
215. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 15 of 17
216. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 15 of 17
217. (increment c2)
   changed: (value c2) from 39 to 49
   goals met: 14 of 17
218. (increment c3)
   changed: (value c3) from 46 to 56
   goals met: 14 of 17
219. (increment c4)
   changed: (value c4) from 55 to 59
   goals met: 14 of 17
220. (increment c5)
   changed: (value c5) from 58 to 60
   goals met: 15 of 17
221. (decrement c1)
   changed: (value c1) from 54 to 51
   goals met: 15 of 17
222. (decrement c1)
   changed: (value c1) from 51 to 48
   goals met: 16 of 17
223. (decrement c7)
   changed: (value c7) from 70 to 60
   goals met: 16 of 17
224. (decrement c6)
   changed: (value c6) from 68 to 63
   goals met: 16 of 17
225. (decrement c6)
   changed: (value c6) from 63 to 58
   goals met: 16 of 17
226. (decrement c5)
   changed: (value c5) from 60 to 58
   goals met: 15 of 17
227. (decrement c5)
   changed: (value c5) from 58 to 56
   goals met: 16 of 17
228. (decrement c4)
   changed: (value c4) from 59 to 55
   goals met: 16 of 17
229. (decrement c3)
   changed: (value c3) from 56 to 46
   goals met: 16 of 17
230. (decrement c2)
   changed: (value c2) from 49 to 39
   goals met: 16 of 17
231. (decrement c1)
   changed: (value c1) from 48 to 45
   goals met: 15 of 17
232. (decrement c1)
   changed: (value c1) from 45 to 42
   goals met: 15 of 17
233. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 15 of 17
234. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 15 of 17
235. (decrement c1)
   changed: (value c1) from 42 to 38
   goals met: 16 of 17
236. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 16 of 17
237. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 16 of 17
238. (decrement c0)
   changed: (value c0) from 46 to 43
   goals met: 16 of 17
239. (decrement c0)
   changed: (value c0) from 43 to 40
   goals met: 16 of 17
240. (decrement c0)
   changed: (value c0) from 40 to 37
   goals met: 17 of 17
